## Terraform data for `apps` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.s42.random_password.next_auth_secret: Refreshing state... [id=none]
module.s42.random_password.postgres: Refreshing state... [id=none]
module.s42.random_password.meilisearch_token: Refreshing state... [id=none]
module.s42.random_password.dragonfly: Refreshing state... [id=none]
module.s42.kubernetes_config_map.stud42_config: Refreshing state... [id=production/stud42-config]
module.s42.module.postgres.kubernetes_config_map.app["config"]: Refreshing state... [id=production/postgres-config]
module.s42.module.postgres.kubernetes_service.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.postgres.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/postgres-data]
module.webhooked.module.webhooked.kubernetes_config_map.app["config"]: Refreshing state... [id=production/webhooked-config]
module.webhooked.module.webhooked.kubernetes_service.app[0]: Refreshing state... [id=production/webhooked]
module.s42.kubernetes_secret.next_auth_secret: Refreshing state... [id=production/next-auth-secret]
module.s42.module.auth_service.kubernetes_service.app[0]: Refreshing state... [id=production/auth-service]
module.s42.module.api.kubernetes_service.app[0]: Refreshing state... [id=production/api]
module.s42.module.meilisearch.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/meilisearch-data]
module.s42.module.interface.kubernetes_service.app[0]: Refreshing state... [id=production/interface]
module.s42.module.meilisearch.kubernetes_service.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.istio.kubectl_manifest.virtual_services["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/virtualservices/app-s42]
module.webhooked.module.secrets.kubernetes_manifest.sealed_secret["s42-webhooked-secrets"]: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_binding_webhooks_dlq: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_queue_webhooks_dlq: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_policy_webhooks_dlq: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq_queue_webhooks_processing: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["ovh-s3-credentials"]: Refreshing state...
module.s42.kubernetes_manifest.rabbitmq: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["github-token"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["sentry-dsns"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["s42-service-token"]: Refreshing state...
module.s42.module.api.kubernetes_deployment.app[0]: Refreshing state... [id=production/api]
module.s42.module.meilisearch_clean_tasks.kubernetes_cron_job_v1.app[0]: Refreshing state... [id=production/meilisearch-clean-tasks]
module.s42.module.auth_service.kubernetes_deployment.app[0]: Refreshing state... [id=production/auth-service]
module.s42.module.service-token.kubernetes_manifest.sealed_secret["auth-service-certs-jwk"]: Refreshing state...
module.s42.module.service-token.kubernetes_manifest.sealed_secret["discord-token"]: Refreshing state...
module.s42.module.interface.kubernetes_deployment.app[0]: Refreshing state... [id=production/interface]
module.s42.module.crawler_locations.kubernetes_cron_job_v1.app[0]: Refreshing state... [id=production/crawler-locations]
module.s42.module.crawler_campus.kubernetes_cron_job_v1.app[0]: Refreshing state... [id=production/crawler-campus]
module.s42.module.postgres.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/postgres]
module.s42.module.postgres.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/postgres-credentials]
module.s42.module.dragonfly.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=production/dragonfly-data]
module.s42.module.dragonfly.kubernetes_service.app[0]: Refreshing state... [id=production/dragonfly]
module.s42.module.webhooks_processor.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooks-processor]
module.s42.module.meilisearch.kubernetes_secret.app["token"]: Refreshing state... [id=production/meilisearch-token]
module.s42.module.dragonfly.kubernetes_secret.app["credentials"]: Refreshing state... [id=production/dragonfly-credentials]
module.s42.module.meilisearch.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/meilisearch]
module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/api]
module.s42.module.auth_service.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/auth-service]
module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/interface]
module.s42.module.dragonfly.kubernetes_stateful_set.app[0]: Refreshing state... [id=production/dragonfly]
module.webhooked.module.webhooked.kubernetes_deployment.app[0]: Refreshing state... [id=production/webhooked]
module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooks-processor]
module.webhooked.module.webhooked.kubernetes_horizontal_pod_autoscaler_v2.app[0]: Refreshing state... [id=production/webhooked]
module.s42.kubernetes_pod_disruption_budget_v1.rabbitmq: Refreshing state... [id=production/rabbitmq]
module.s42.kubernetes_manifest.rabbitmq_exchange_webhooks: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s42.module.api.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/api"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.27.1" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.27.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "api"
                        # (8 unchanged attributes hidden)

                        # (24 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.api.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/api"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.api.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/api"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "api"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.auth_service.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/auth-service"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "auth-service"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.27.1" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.27.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "auth-service"
                        # (8 unchanged attributes hidden)

                        # (8 unchanged blocks hidden)
                    }

                    # (4 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.auth_service.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/auth-service"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "auth-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.auth_service.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/auth-service"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "auth-service"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.crawler_campus.kubernetes_cron_job_v1.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job_v1" "app" {
        id = "production/crawler-campus"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-campus"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
                      ~ "version"                      = "v0.27.1" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.27.1" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (12 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.27.1" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-campus"
                                # (8 unchanged attributes hidden)

                                # (12 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.crawler_locations.kubernetes_cron_job_v1.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job_v1" "app" {
        id = "production/crawler-locations"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "crawler-locations"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {
              ~ metadata {
                  ~ labels      = {
                      ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
                      ~ "version"                      = "v0.27.1" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {
                      ~ metadata {
                          ~ labels      = {
                              ~ "version"                      = "v0.27.1" -> "latest"
                                # (5 unchanged elements hidden)
                            }
                            # (2 unchanged attributes hidden)
                        }

                      ~ spec {
                            # (12 unchanged attributes hidden)

                          ~ container {
                              ~ image                      = "ghcr.io/42atomys/stud42:v0.27.1" -> "ghcr.io/42atomys/stud42:latest"
                                name                       = "crawler-locations"
                                # (8 unchanged attributes hidden)

                                # (14 unchanged blocks hidden)
                            }

                            # (3 unchanged blocks hidden)
                        }
                    }
                }
            }
        }
    }

  # module.s42.module.interface.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/interface"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.27.1" -> "latest"
                        # (4 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.27.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "interface"
                        # (8 unchanged attributes hidden)

                        # (32 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.interface.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/interface"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.interface.kubernetes_service.app[0] will be updated in-place
  ~ resource "kubernetes_service" "app" {
        id                     = "production/interface"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "interface"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.meilisearch_clean_tasks.kubernetes_cron_job_v1.app[0] will be updated in-place
  ~ resource "kubernetes_cron_job_v1" "app" {
        id = "production/meilisearch-clean-tasks"

      ~ spec {
            # (6 unchanged attributes hidden)

          ~ job_template {

              ~ spec {
                    # (7 unchanged attributes hidden)

                  ~ template {

                      ~ spec {
                            # (12 unchanged attributes hidden)

                          ~ container {
                                name                       = "meilisearch-clean-tasks"
                                # (9 unchanged attributes hidden)

                              ~ resources {
                                  ~ limits   = {
                                      + "memory" = "128Mi"
                                    }
                                  ~ requests = {
                                      + "cpu"    = "100m"
                                      + "memory" = "128Mi"
                                    }
                                }

                                # (2 unchanged blocks hidden)
                            }

                            # (2 unchanged blocks hidden)
                        }

                        # (1 unchanged block hidden)
                    }
                }

                # (1 unchanged block hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.s42.module.service-token.kubernetes_manifest.sealed_secret["oauth2-providers"] must be replaced
-/+ resource "kubernetes_manifest" "sealed_secret" {
      ~ manifest = {
          ~ spec       = {
              ~ encryptedData = { # forces replacement
                  ~ "TWITCH_ID"        = "AgA+GSnPDqS642BK9CaWx2EEt9FWH1ZlzQNGjGpcdGn6dF2wuiRLgF1N1YrRtTUrVQFqhc5IPIHk+TGwGxkeCSB6QiSUhgUrqBAQ6YBUhwIOUI5oWrjLOpOEg5t48ZKbPf67sx8PGn7BRyU0SL8hCWE/jxFVSmDwgdlMdwi3vdDkp85eNYLnU9B+XFeL/44MqS4LQztsoc/jiKhc5QKJHICimdlQfyioVaI9G+MDUOkCDZ8yrmM7KJBEHV04jsSuK0pactVp+9h2iCMbyMsOkZDeFExLX0NXGWjZJpQnAqeZrqAIR25viSW1VpNb4DLcYyxN3DMZMK068wA/4JbrnxPUhIbo3WS8vlnNCogMp8PZ0F+c1x60ngc5SLJtlczDSVfn5khCEufOEvSytHBvLRXfkXLWAG8MDpGMA599mw3hHopjHl6OId/143hkUyaAP7zKseQoTJtcavaRlbLBxmKjm8xXLBuDqjQ0Pkb6ZAmxpnOLLlUz65DT8raWObIITvzPs5k9tpRVrCvluykVpl0F61GDPIyC9yrKLsLwJ3/kI1LwBeTOsMhlZ/iwb2wyn5xlvm9jg4tIrdfYjwW4bUxzepLY32sJjlTYsThZZ464eCyc5FwwWkWaOenpVFRw/+J5VMRMIN7hoIQvpVOXu/s2VxYGrBm7N4nRY8or1ZpwfDl0FAFLf0xqz7G/ZNJWVbIaLkUtqpQYHYMqd9zMbIZnc7IrWW2/EZpA8MZnyfs=" -> "AgBE0/EthGy4c5HaKRX5zIl8o0XUtTIvCp6UAcIkxTWLpt3PYXvzJjQbFngDvxCxyULA3wchJVOeEtL3cctSfSaZsGH+NYJx5eCQnkyOW2Ock+/o8bMU+C0Su9HBErwpUVOdGwApcl1ENBJsPHnMnKhhIuDunAkrq7ZKRAkQoVos8ZB/bvUNyrKldopo2MHtrkCmV6cosSady+16Lb6IQ7FTyBbopXQjaeaY51sz4cPKBDKBQd7KQXzsuhOzs9FXda2CjF85MDDyt9K8W203l2bEMnz5GOn6RHGdbDTTNnhyR30ce4b6y++qDLWYPytV3xtlNGmJOmIAowdxOf2wvnP6HMHSWqlGb6s19PJAoJzVkR+aKz7Vn2X6dLPVnZhqo4mwBA06Lybj/qxy5TlmxZRDZtEMExDy5aUalrRTwLeCvioBzmGBctOeDX36X/y17wV2/+plD6/ACjo4TyM0t1G1U6mHqkvTnz8SnAkiih7Ubt7xQ4hJ0GdEvS3sMOkmzOpQnrN1fhFADlHoswAEa9h2UG7Aok+T6EoY6S88YkXpqizcd/nQejUx+NHsRXVkrgiz8345STUH+pJEPm8lS3SdAZbjMuqfsHsG8Gw5JM51rf1I3smQke/K/LnKwZxD/G2BDhWwMfqYuF5dSu0t4ghV0QPyu3ARnbrm3PSEht11Ijyjhdm0bpxe1P++socAJYtcQkbSEf4P6wytB8s+YmWhNhjEAwDxhaA26NA506A="
                  ~ "TWITCH_SECRET"    = "AgBC6UDmw9gkqOP3w+MQd5yQacjfVrq+/tDpvyuFX79cSKUIoLJBqx2wYmr3O1SuX3T1sZJgdR4MLj9kWd819H9kBx4C7hWb34WjLJkyL4zV+trB+0ssbR3O7PDCLPTJ5o0I1kjvdvHDaadJkdfrtsmGst03DEhXqhv5sxBxXCwCc6yBU864k5QkptQGmMTn+2Itv4xihDu9rahFRvjAb6nWPeYvd/sk78Q9UlMH9W1snqupBqqrtoYzcNbWRY+EStjxDMzpugVuqFXg1nFJieGfM5Ts780WwdnxOm6azb52OtHWOoXBOBCDxb4kR3gBlSEnp7QIXp82fZhSvwuPie8xPs1CrejwbEZ67WPncgrugzoxcmzFTNytnDK9uR/FaE0jHOi51oMCPxZ0/m5DyRnnpRDHhSfPpTmcozo0n/ksz6Ev/h/yUKR10UaBv2G76c7Idvv7mWhyitg8mrJmPbLD0Xpp1bfzdNVcVLoYIzVgHdj+9smZb/uv7S+tYJ0UhZbq+5VJTkO/FQSTJNg55u9BnqEY68cBP9DBES+PweEXy9ghj3cM0zdxG9QySBSqpEC4nDsw64/P7k8xwX1mow2wqXHAJ01abNutbGXRkF05vRezEUSFBs/PqV9/l9rpyqwmVJz5hgyX8fso3EnxS1rkZ7yL753CS00QbuMiSoh/UtB2QwiI60tbhuJNPbDZUKKmmBQMzM6ibTzGBkT09YV5dj83CpWjcgFoHSkcgNVU9pkP6JXIg9LXTBpVIJsr258hDQ==" -> "AgCKbcPF+8QyfSUe5oKR7Bg1VdSXCxvMLYunmAnfqJSMQaAYdAfOTAzaE7a+uyYgmmIO89NWzA0G/sQKDhfdsPL5UZrEERG0gLMh657en/oZtCQ4TQg2dVNNunWHQVGh8uXXBtNlfFORi6lgTRn9PKtmgTOHXhcIC6L8ph2AjYZ9wlR+MisGDQVcNU86s9pg0wLuf7EjdMFpCKjjcx3+01y+oN9qHvkATD0yX4kSstpRN4hLHvhumYGhPpd8GP6zhKf+kz7RUK+Nbsf+rcj8rOZws4EtMRtK3RYSrdrdBXPByt/a9/NqilmceFBoxVKpbTEK+iOEqFhsLJVSPFc34/0I0h8359Qx09BzPdoPI4+UI7X79BO6LL2+b7PPeQ9neU/J2TSmbWACtZIJeQjqhzdbzZLaNwYq0SAZATueMnZpCUCaAtbpomNy4mrHDbgW1+EPNxncKjQsTL38in4WzMrvyarVhmSPOsmjplCS1CLd8tXW1c4liuGhXm9gDRD8vOjskEm9+OMn75ffHr7MOnW9NxFpi0FBRVSjy8DcdMLUQydsI5CVWbMU9mUqNWZQoFmfwkKAFwXPn5+ywu0yGWIKDH42AAskQuXCBBF9n3/lrM924pPEjIpJztitfrxiIou8FbQvF0hMCL5hve6tuLjW9xkGuE3l0LY7zQIEMcSO71HTM40pj8qYyZr2yM1G41VQFpRLSS6ZUEw74D+VRJYRUEDmP7YhgIkoGtMIpxs="
                    # (18 unchanged elements hidden)
                }
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ annotations                = {
                  - "sealedsecrets.bitnami.com/cluster-wide"   = "false"
                  - "sealedsecrets.bitnami.com/namespace-wide" = "true"
                } -> (known after apply)
              ~ creationTimestamp          = null -> (known after apply)
              ~ deletionGracePeriodSeconds = null -> (known after apply)
              ~ deletionTimestamp          = null -> (known after apply)
              ~ finalizers                 = null -> (known after apply)
              ~ generateName               = null -> (known after apply)
              ~ generation                 = null -> (known after apply)
              ~ labels                     = null -> (known after apply)
              ~ managedFields              = null -> (known after apply)
                name                       = "oauth2-providers"
              ~ ownerReferences            = null -> (known after apply)
              ~ resourceVersion            = null -> (known after apply)
              ~ selfLink                   = null -> (known after apply)
              ~ uid                        = null -> (known after apply)
                # (1 unchanged element hidden)
            }
          ~ spec       = {
              ~ data          = null -> (known after apply)
              ~ template      = {
                  ~ data     = null -> (known after apply)
                    # (2 unchanged elements hidden)
                }
                # (1 unchanged element hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_deployment.app[0] will be updated in-place
  ~ resource "kubernetes_deployment" "app" {
        id               = "production/webhooks-processor"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ metadata {
                  ~ labels      = {
                      ~ "version"                      = "v0.27.1" -> "latest"
                        # (5 unchanged elements hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/42atomys/stud42:v0.27.1" -> "ghcr.io/42atomys/stud42:latest"
                        name                       = "webhooks-processor"
                        # (8 unchanged attributes hidden)

                        # (20 unchanged blocks hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.s42.module.webhooks_processor.kubernetes_horizontal_pod_autoscaler_v2.app[0] will be updated in-place
  ~ resource "kubernetes_horizontal_pod_autoscaler_v2" "app" {
        id = "production/webhooks-processor"

      ~ metadata {
          ~ labels           = {
              ~ "app.kubernetes.io/version"    = "v0.27.1" -> "latest"
              ~ "version"                      = "v0.27.1" -> "latest"
                # (5 unchanged elements hidden)
            }
            name             = "webhooks-processor"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 14 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: apps-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "apps-tfplan"

```
</details>